---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberRoughness
source: html/475ddcae-7d47-fe12-fbb8-f050477769db.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberRoughness Property

The property labeled "Roughness for secondary highlight" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".